# -*- coding:utf-8 -*-
# @Time     : 2019-06-08 22:44
# @Author   : 胡远
# @Github   : https://github.com/QuixoteHY
# @Email    : 1290482442@qq.com
# @Describe :


asset_liability_rate = ['现金与约当现金比率', '应收账款比率', '存货比率', '流动资产比率', '应付账款比率',
                        '流动负债比率', '长期负债比率', '股东权益比率']
financial_structure = ['负债占资产比率', '长期资金占投资比率']
solvency = ['流动比率', '速动比率']
business_capability = ['应收账款周转率(次)', '平均收现日数', '存货周转率(次)', '平均销货日数(平均在库天数)',
                       '固定资产周转率', '总资产周转率']
profitability = ['净资产收益率RoE', '总资产报酬率RoA', '销售毛利率', '销售净利率', '净利率', '基本每股收益',
                 '税后净利(百万元)']
cash_flow = ['现金流量比率', '营业活动现金流量(百万元)', '投资活动现金流量(百万元)', '筹资活动现金流量(百万元)']


fina_indicators_dict = {
    # 资产负债比率(占总资产%)
    '现金与约当现金比率': dict(),
    '应收账款比率': dict(),
    '存货比率': dict(),
    '流动资产比率': dict(),
    '应付账款比率': dict(),
    '流动负债比率': dict(),
    '长期负债比率': dict(),
    '股东权益比率': dict(),
    # 五大财务比率
    # 财务结构
    '负债占资产比率': dict(),
    '长期资金占投资比率': dict(),
    # 偿债能力
    '流动比率': dict(),
    '速动比率': dict(),
    # 经营能力
    '应收账款周转率(次)': dict(),
    '平均收现日数': dict(),
    '存货周转率(次)': dict(),
    '平均销货日数(平均在库天数)': dict(),
    '固定资产周转率': dict(),
    '总资产周转率': dict(),
    # 获利能力
    '净资产收益率RoE': dict(),
    '总资产报酬率RoA': dict(),
    '销售毛利率': dict(),
    '销售净利率': dict(),
    # '经营安全边际率(%)': dict(),
    '净利率': dict(),
    '基本每股收益': dict(),
    '税后净利(百万元)': dict(),
    # 现金流量
    '现金流量比率': dict(),
    # '现金流量允当比率': dict(),
    # '现金再投资比率': dict(),
    '营业活动现金流量(百万元)': dict(),
    '投资活动现金流量(百万元)': dict(),
    '筹资活动现金流量(百万元)': dict(),
}
